print("KPH\tMPH")
print("------------")

for KPH in range(60, 140, 10):
    MPH = KPH * 0.6214
    print("{:3d}\t{:4.1f}".format(KPH, MPH))

print("------------")

"""
{:3d}: นี่คือ format specifier ที่ระบุว่าค่าที่จะแสดงผลเป็นจำนวนเต็ม (d) และควรมีขนาด 3 ตัวเลข ซึ่งจะทำให้ค่าของ KPH มี 3 หลัก และหากตัวเลขเป็นจำนวนน้อยกว่า 3 หลัก จะถูกเติมด้วยช่องว่างด้านหน้า

{:4.1f}: นี่คือ format specifier อีกตัวหนึ่ง ที่ระบุว่าค่าที่จะแสดงผลเป็นเลขทศนิยม (f) และควรมีขนาด 4 ตัวเลข ซึ่งรวมถึงทศนิยม 1 ตำแหน่ง ทำให้ค่าของ MPH มี 4 หลัก ที่รวมถึงจุดทศนิยมและหลักทศนิยม 1 ตำแหน่ง

ภายใน format method เรากำหนดค่า KPH และ MPH ที่จะใส่แทนลงใน format specifier ที่เหมาะสม
"""